textLevel='["Светодиод (от английски light-emitting diode, LED) е \
полупроводников диод, който се състои от p-n преход, който излъчва некохерентна светлина в тесен спектър, \
когато през него протича електрически ток в права посока. Обикновено светодиодът съдържа един или няколко \
излъчващи светлина кристали, разположени в един корпус с леща, която формира светлинния поток. \
Светодиодите са много различни видове и според състава си светят с различна светлина. \
За да може да свети, трябва да бъдат изпълнение няколко условия. Най-важното, от които е токът в права посока да бъде \
с точния за определения модел светодиод. Ограничаването на тока се постига по много различни начини от резистор до стабилизатор на ток. Изберете електронен елемент отдясно, с помощта на който може най-лесно да се осигури ограничение на тока през веригата." ,\
"Това е край на Първо ниво : С помощта на резистор може да се ограничи тока през светодиод. Може да се използва и потенциометър, но трябва да бъде правилно подбран и става за светодиоди с по-ниска консумация на ток. \
Най-добрия начин за контрол на тока през светодиод е като използваме стабилизатор на ток. Това е електронна схема, която има за цел да \
да осигури постоянен ток, независимо от параметрите на кабелите, типа на захранването, броя включени светодиоди и други параметри. \
Повече за стабилизаторите на напрежение може да научите от главното меню в раздел Токоизправители.",\
"Свържете проводниците, така че да светнат и двете крушки. Помислете какъв ток ще, протече през всяка една от тях. По-силно или по-слабо ще светнат крушките, ако се свържат последователно, като е на схемата?",\
"При последователно свързване на консуматори (в случая крушки), пада на напрежение върху всяка една от тях ограничава тока. По този начин тока, който ще протече е с по-ниска стойност и крушките ще светят по-слабо, отколкото ако са успоредно свързани или е свързана само една крушка.",\
"Реализирайте еднополупериоден токоизправител. Това е най-простата схема на изправител, като целта е да се получи право напрежение, с което работят повечето електронни схеми.",\
"Прилага се за малки мощности, при които к.п.д. няма голямо значение. Предимства на тази схема са нейните простота и ниска цена. Недостатъците й са големият коефициент на пулсации. ",\
"Изберете елемент, с който може да си променя параметрите и с негова помощ може да се променя стойността на тока през светодиода. В най-дясната колонка сложете вертикално светодиод.",\
"Успешно завършихте ниво 4. С помощта на потенциометър може да се регулира стойността на тока през светодиод и по този начин силата му на светене. Това обаче се отнася за маломощни светодиоди и е опростен модел на регулиране.",\
"Светодиодите светят само при протичане на правилен по големина и посока ток. Светодиодите имат катод и анод. Трябва да се внимава как са свързани. Ако обърнем полярността, светодиода няма да светне и ток няма да протече. Изберете елементи, така че поне единият светодиод да светне.",\
"Диодът има два електрода, наречени анод и катод. Той е в състояние да провежда ток от анода към катода, но не и обратно. Маркирането, не е достъпно за всички диоди. Може да измерите анод и катод на диода с помощта на мултицет - Превключете мултицета в режим на диоден тест - до съответната позиция на превключвателя има обозначението на тази част. Червената сонда съответства на анода, черната на катода. В правилната полярност ще се покаже директен спад на напрежението през диода, в грешен такъв е посочен безкрайност",\
"Довършете схемата на двуполупериодния токоизправител като добавите и консуматор крушка. ",\
"Двуполупериодния токоизправител ползва така наречената схема ГРЕЦ. Тя се състои от 4 диода, като те са свързани по начин, по който да през всеки полупериод да работят 2 от тях, а другите 2 да са запушени. Отпушените диоди осигуряват протичането на ток към консуматора. С добавянето на кондензатор се получава много добре филтрирано изправено напрежение.",\
"Ниво 7 начало.",\
"Ниво 7 край."]';